{
  "general": {
    "url": "https://my-resume-389001.uc.r.appspot.com/",
    "url_text": "https://my-resume-389001.uc.r.appspot.com/",
    "source_url": "https://github.com/mohamedRhaiem/my-cv",
    "source_url_text": "GitHub"
  },
  "personal": {
    "name": "Mohamed Ben Rhaiem",
    "role": "Senior Full-Stack Engineer \n| Technical Leader & Software Architect",
    "address": {
      "address": ["11 rue de la sarrazine"],
      "city": "Paris",
      "state": "Île-de-France",
      "postal": "92220",
      "country": "France"
    },
    "contacts": ["email: mohamed.rhaiem@gmail.com", "whatsapp: 005511950255658"]
  },

  "presentation": "A highly skilled full-stack engineer with deep expertise across multiple programming languages and technologies, focused on developing high-quality, scalable software solutions, usually open to new opportunities and looking to join a dynamic and innovative team to use my expertise in designing and developing software solutions to help the company to achieve its goals.",
  "about": [
    {
      "summary": "Over the past 10 years, I have consistently demonstrated the ability to quickly grasp complex systems, identify critical issues, and drive improvements that enhance both performance and user experience.With a strong foundation in software methodologies and a collaborative leadership style, I excel in aligning teams with project goals and timelines. Since earning my Software Engineering degree in 2014, I have gained experience across various industries, including digital advertising,flight monitoring, e-learning, finance, job-seeking platforms, and audit systems. Over the last five years, I have taken on senior roles as a technical leader and software architect. However, my passion remains full-stack development, where I stay actively involved throughout the entire software development lifecycle—from discovery to deployment and maintenance.My core technical strengths include Java, Node.js, React, and Angular, and I bring an in-depth understanding of modern tech stacks to every project. I’m committed to delivering exceptional software solutions and fostering strong collaboration within teams."
    }
  ],
  "skills": [
    {
      "domain": "Programming Languages",
      "skills": [
        {
          "skill": "JAVA",
          "subskills": [
            "Spring Framework",
            "Spring Boot",
            "Apache Spark",
            "JSF/EJB",
            "Event, REST and SOAP Web Services"
          ]
        },
        {
          "skill": "Javascript,TypeScript, HTML & CSS",
          "subskills": [
            "Node(nestJs)",
            "TypeOrm",
            "ReactJS",
            "Ant design",
            "Material UI",
            "UmiJs",
            "Dva-saga",
            "Redux",
            "AngularJS",
            "Angular 2 3 4",
            "Angular material",
            "Bootstrap",
            "Rxjs",
            "Ionic 1/2",
            "Cordova",
            "jQuery",
            "WebPack",
            "WebPackModuleFederation",
            "Rollup",
            "HTML5",
            "scss"
          ]
        }
      ]
    },
    {
      "skill": "Broker",
      "subskills": [
        "RabbitMq",
        "kafka"
      ]
    },
    {
      "domain": "CI/CD tool and Virtualization",
      "skills": [
        {
          "skill": "Git"
        },
        {
          "skill": "Gitab"
        },
        {
          "skill": "Jenkins"
        },
        {
          "skill": "Docker/Docker Compose"
        },
        {
          "skill": "SonarQube"
        }
      ]
    },
    {
      "domain": "Test tool",
      "skills": [
        {
          "skill": "Jest"
        },
        {
          "skill": "Junit"
        },
        {
          "skill": "JaCoCo"
        },
        {
          "skill": "Newman"
        },
        {
          "skill": "Puppeeter"
        }
      ]
    },
    {
      "domain": "Databases",
      "skills": [
        {
          "skill": "MySQL"
        },
        {
          "skill": "Oracle"
        },
        {
          "skill": "MongoDB"
        },
        {
          "skill": "PostgreSQL"
        },
        {
          "skill": "Snowflake"
        }
      ]
    },
    {
      "domain": "Services",
      "skills": [
        {
          "skill": "Push notification"
        },
        {
          "skill": "Geolocalization"
        },
        {
          "skill": "OCR"
        },
        {
          "skill": "OAuth 2.0"
        },
        {
          "skill": "SMS"
        }
      ]
    },
    {
      "domain": "Os Distributions",
      "skills": [
        {
          "skill": "Ubuntu"
        },
        {
          "skill": "OS X"
        }
      ]
    },
    {
      "domain": "Cloud Services",
      "skills": [
        {
          "skill": "AWS lamdda, RDS, S3, EC2, Vpc network, Api gateway"
        },
        {
          "skill": "Google app engine, Apigee, Build, Strorage, Vpc network, Run"
        },
        {
          "skill": "CloudFoundry"
        }
      ]
    },
    {
      "domain": "Other Technologies",
      "skills": [
        {
          "skill": "Server",
          "subskills": [
            "Mobile First 7.1",
            "WebSphere 8.0.0",
            "Apache",
            "Tomcat",
            "JBoss",
            "Lamp",
            "Rundeck"
          ]
        },
        {
          "skill": "Package manager",
          "subskills": ["maven","gradle", "npm", "yarn", "bower","pnpm"]
        },
        {
          "skill": "Modeling languages",
          "subskills": ["UML"]
        },
        {
          "skill": "Work methodology",
          "subskills": ["SCRUM"]
        },
        {
          "skill": "task management",
          "subskills": ["Jira","Trello"]
        }
      ]
    }
  ],

  "social_links": {
    "GitHub": "https://github.com/mohamedRhaiem/",
    "Linkedin": "https://www.linkedin.com/in/mohamed-ben-rhaiem-67012151/"
  },
  "work_experiences": [
    {
      "company": " GSW → Embraer",
      "position": "Senior Software Engineer",
      "location": "São Paulo, Brazil",
      "dates": {
        "start": "04/23",
        "end": "actual"
      },
      "description": "As a contractor, led the delivery of analytics data to enhance insight into flight monitoring and improve operational decision-making.",
      "accomplishments": [
        "Data-Driven Insights: Developed a real-time system that analyzed flight data, providing critical insights and generating health alerts that improved flight safety and operational efficiency.",
        "System Decomposition: Spearheaded the deconstruction of legacy monolith applications into microservices, optimizing system maintainability, and scalability, and reducing deployment time by 90%.",
        "Performance Improvements: Optimized data pipelines using Kafka and Spark, reducing data processing latency by 50%, and allowing faster analytics and alert delivery."
      ]
    },
    {
      "company": "InAllMedia → Indeed",
      "position": "Senior Software Engineer",
      "location": "Austin, Texas",
      "dates": {
        "start": "10/21",
        "end": "03/23"
      },
      "description": "Contractor role focused on developing new features and improving the job seeker system for enhanced user experience and platform efficiency.",
      "accomplishments": [
        "Feature Development: Delivered key sprint tasks, translating client requirements into robust features for the job seeker application.",
        "Bug Resolution: Identified, diagnosed, and resolved critical issues in the resume search application, improving system reliability and reducing time response by 20%.",
        "Component Reusability: Developed reusable services and components for both backend and frontend applications, streamlining development efforts and accelerating feature delivery by 99%."
      ]
    },
    {
      "company": "HartB → Globo",
      "position": "Software System Architect",
      "location": "Sao Paulo, Brazil",
      "dates": {
        "start": "08/20",
        "end": "09/21"
      },
      "description": "Led an IT team to migrate and modernize the internal advertising distribution system while also designing a B2B bonus advertising platform, focusing on improving scalability, performance, and development efficiency.",
      "accomplishments": [
        "System Migration and Modernization: Led the successful migration of the advertising distribution system to a more scalable architecture, improving system reliability and reducing response time by 50%.",
        "Development Standards: Established and enforced coding standards, technology choices, and workflow processes that enhanced collaboration and improved code quality across multiple projects.",
        "CI/CD Optimization: Designed and implemented CI/CD pipeline templates tailored to various project types, reducing deployment times by 45% and enhancing the quality of software releases.",
        "Reusable Components: Developed reusable services and components, including a front-end component library and backend project starters, which increased development speed and reduced redundancy across projects."
      ]
    },
    {
      "company": "Meritt",
      "position": "Senior Software Engineer",
      "location": "Sao Paulo, Brazil",
      "dates": {
        "start": "10/19",
        "end": "07/20"
      },
      "description": "Contributed to the development of a digital education results platform, ensuring seamless integration of logistics and devolution functionalities.",
      "accomplishments": [
        "Technical Leadership: Developed detailed technical product specifications with a strong focus on system integration and feasibility, ensuring smooth collaboration between teams and optimized platform performance.",
        "Agile Development: Worked in an Agile environment with weekly iterations, adapting swiftly to client needs and delivering high-priority features on time, leading to improved client satisfaction and faster feedback loops.",
        "Platform Optimization: Enhanced platform performance and scalability by refactoring backend services and implementing best practices, reducing response times by 50% and improving overall system stability."
      ]
    },
    {
      "company": "CI&T",
      "position": "Senior Software Engineer",
      "location": "Sao Paulo, Brazil",
      "dates": {
        "start": "11/17",
        "end": "09/19"
      },
      "description": "Contributed to the development and delivery of key digital banking features, focusing on prepaid card issuance and money transfer functionalities.",
      "accomplishments": [
        "Micro Front-End Standards: Led the definition and adoption of micro front-end architecture standards, enhancing code reusability and enabling smoother integration across multiple banking features.",
        "Feature Delivery: Delivered critical digital banking features that streamlined prepaid card issuance and money transfer processes, improving user experience and reducing operational overhead by 69%."
      ]
    },
    {
      "company": "Murah Technologies",
      "position": "Full Stack Developper",
      "location": "Sao Paulo, Brazil",
      "dates": {
        "start": "01/15",
        "end": "10/17"
      },
      "description": "Designed, developed, and maintained critical features for an audit and banking system, ensuring high-quality deliverables and enhanced system efficiency.",
      "accomplishments": [
        "Bank Account Online System: Architected and developed the complete environment for the Bank Account Online process, improving system performance, scalability, and security, leading to an 80% increase in customer satisfaction and a 20% reduction in processing times.",
        "Mobile Application Development: Led the development of a mobile app for public guaranty fund management, streamlining workflows and decreasing process time by 80%.",
        "Client Issue Resolution: Efficiently resolved high-priority client bugs and system issues, reducing downtime and improving platform stability, which resulted in improved client retention and operational efficiency."
      ]
    },
    {
      "company": "ÉNOIS Inteligência Jovem",
      "position": "Junior Software Engineer",
      "location": "Sao Paulo, Brazil",
      "dates": {
        "start": "02/14",
        "end": "08/14"
      },
      "description": "Customization of an already open source E-learning platform for journalism context.",
      "accomplishments": [
        "Cutomise an already Django App to reply to journalism concept,in the look and the behaviour ",
        "Building a shared environment for students to share their work and to be able to exchange knowledge’s and ideas between all the students. ",
        "Design and implementation for web client app."
      ]
    }
  ],

  "education": [
    {
      "school": "Private Higher School of Engineering and Technology (ESPRIT)",
      "degree": "National diploma in Software Computer Science Engineering (DNI)",
      "dates": {
        "start": "2011",
        "end": "2014"
      }
    },
    {
      "school": "Higher Faculty of Sciences of Tunis (FST)",
      "degree": "National Bachelor in Telecommunication and Computer (BTC)",
      "dates": {
        "start": "2007",
        "end": "2011"
      }
    }
  ],

  "languages": [
    {
      "language": "English",
      "level": "Upper Intermidiate"
    },
    {
      "language": "French",
      "level": "intermediate"
    },
    {
      "language": "Portuguese",
      "level": "Advanced"
    },
    {
      "language": "Arab",
      "level": "mother tongue"
    }
  ],
  "communities": [
    {
      "organization": "Mural",
      "link": "https://www.agenciamural.org.br"
    },
    {
      "organization": "Aiesec",
      "link": "https://aiesec.org"
    }
  ]
}
